# Test data API and download data #1
240416

In [1]:
from datetime import datetime
from pykrx import stock
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import yfinance as yf

In [2]:
tickers = stock.get_index_ticker_list()
tickers_list = {}
for i in range(len(tickers)):    
    names = stock.get_index_ticker_name(tickers[i])
    tickers_list[names] = tickers[i]

In [3]:
tickers_list

{'코스피': '1001',
 '코스피 대형주': '1002',
 '코스피 중형주': '1003',
 '코스피 소형주': '1004',
 '음식료품': '1005',
 '섬유의복': '1006',
 '종이목재': '1007',
 '화학': '1008',
 '의약품': '1009',
 '비금속광물': '1010',
 '철강금속': '1011',
 '기계': '1012',
 '전기전자': '1013',
 '의료정밀': '1014',
 '운수장비': '1015',
 '유통업': '1016',
 '전기가스업': '1017',
 '건설업': '1018',
 '운수창고업': '1019',
 '통신업': '1020',
 '금융업': '1021',
 '증권': '1024',
 '보험': '1025',
 '서비스업': '1026',
 '제조업': '1027',
 '코스피 200': '1028',
 '코스피 100': '1034',
 '코스피 50': '1035',
 '코스피 200 커뮤니케이션서비스': '1150',
 '코스피 200 건설': '1151',
 '코스피 200 중공업': '1152',
 '코스피 200 철강/소재': '1153',
 '코스피 200 에너지/화학': '1154',
 '코스피 200 정보기술': '1155',
 '코스피 200 금융': '1156',
 '코스피 200 생활소비재': '1157',
 '코스피 200 경기소비재': '1158',
 '코스피 200 산업재': '1159',
 '코스피 200 헬스케어': '1160',
 '코스피 200 중소형주': '1167',
 '코스피 200 초대형제외 지수': '1182',
 '코스피 200 비중상한 30%': '1224',
 '코스피 200 비중상한 25%': '1227',
 '코스피 200 비중상한 20%': '1232',
 '코스피200제외 코스피지수': '1244',
 '코스피 200 TOP 10': '1894'}

In [4]:
kospi_tickers = stock.get_market_ticker_list(datetime.today().strftime('%Y%m%d'), market='KOSPI')
kospi_tickers_list = {}
for i in range(len(tickers)):    
    names = stock.get_market_ticker_name(kospi_tickers[i])
    kospi_tickers_list[names] = kospi_tickers[i]

In [5]:
kospi_tickers_list

{'AJ네트웍스': '095570',
 'AK홀딩스': '006840',
 'BGF': '027410',
 'BGF리테일': '282330',
 'BNK금융지주': '138930',
 'BYC': '001460',
 'BYC우': '001465',
 'CJ': '001040',
 'CJ CGV': '079160',
 'CJ4우(전환)': '00104K',
 'CJ대한통운': '000120',
 'CJ씨푸드': '011150',
 'CJ씨푸드1우': '011155',
 'CJ우': '001045',
 'CJ제일제당': '097950',
 'CJ제일제당 우': '097955',
 'CR홀딩스': '000480',
 'CS홀딩스': '000590',
 'DB': '012030',
 'DB금융투자': '016610',
 'DB손해보험': '005830',
 'DB하이텍': '000990',
 'DGB금융지주': '139130',
 'DI동일': '001530',
 'DL': '000210',
 'DL우': '000215',
 'DL이앤씨': '375500',
 'DL이앤씨2우(전환)': '37550L',
 'DL이앤씨우': '37550K',
 'DN오토모티브': '007340',
 'DRB동일': '004840',
 'DSR': '155660',
 'DSR제강': '069730',
 'DS단석': '017860',
 'E1': '017940',
 'ESR켄달스퀘어리츠': '365550',
 'F&F': '383220',
 'F&F홀딩스': '007700',
 'GKL': '114090',
 'GS': '078930',
 'GS건설': '006360',
 'GS글로벌': '001250',
 'GS리테일': '007070',
 'GS우': '078935',
 'HDC': '012630',
 'HDC랩스': '039570'}

In [6]:
from_date = stock.get_index_listing_date('KOSPI').loc['코스피'].기준시점

In [7]:
from_date = from_date.replace('.', '')
to_date = datetime.today().strftime('%Y%m%d')

kospi200 = stock.get_index_fundamental(from_date, to_date, tickers_list['코스피'])
print(kospi200)

                 종가   등락률        PER  선행PER   PBR  배당수익률
날짜
1980-01-04   100.00  0.00   0.000000    0.0  0.00   0.00
1980-01-05   100.15  0.00   0.000000    0.0  0.00   0.00
1980-01-07   102.53  0.00   0.000000    0.0  0.00   0.00
1980-01-08   105.28  0.00   0.000000    0.0  0.00   0.00
1980-01-09   106.37  0.00   0.000000    0.0  0.00   0.00
...             ...   ...        ...    ...   ...    ...
2024-04-22  2629.44  1.45  19.320000    0.0  0.96   1.84
2024-04-23  2623.02 -0.24  19.270000    0.0  0.95   1.84
2024-04-24  2675.75  2.01  19.660000    0.0  0.97   1.81
2024-04-25  2628.62 -1.76  19.309999    0.0  0.95   1.84
2024-04-26  2654.76  0.99   0.000000    0.0  0.00   0.00

[11817 rows x 6 columns]

c:\Users\alan.kwak\AppData\Local\Programs\Python\Python311\Lib\site-packages\pykrx\website\krx\market\wrap.py:1061: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df = df.replace('^-$', 0, regex=True)

In [8]:
# kospi200.to_csv('./kospi.csv')

In [9]:
# '삼성전자' in kospi_tickers_list
[k for k, v in kospi_tickers_list.items() if v == '005935']

[]

In [10]:
stock.get_market_ticker_name("005930")

'삼성전자'

In [11]:
sec = stock.get_market_ohlcv(from_date, to_date, '005930')

In [12]:
sec.head()

               시가     고가     저가     종가    거래량       등락률
날짜
1990-01-03  44000  45000  43200  44800  26240       NaN
1990-01-04  45000  45800  44800  45300  41900  1.116071
1990-01-05  45000  45300  44300  44300  27400 -2.207506
1990-01-06  44800  45000  44500  44500  26380  0.451467
1990-01-08  44500  44900  44000  44000  14790 -1.123596

In [13]:
sec.tail()

               시가     고가     저가     종가       거래량       등락률
날짜
2024-04-22  77400  77500  75100  76100  30469477 -1.932990
2024-04-23  76400  76800  75500  75500  18717699 -0.788436
2024-04-24  77500  78800  77200  78600  22166150  4.105960
2024-04-25  77300  77500  76300  76300  15549134 -2.926209
2024-04-26  77800  77900  76800  77300   6495668  1.310616

In [14]:
# sec.to_csv('./sec.csv')

In [15]:
df_rate = yf.download('USDKRW=X')
df_rate.head()

[*********************100%%**********************]  1 of 1 completed

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2003-12-01,1197.300049,1203.500000,1195.000000,1198.400024,1198.400024,0
2003-12-02,1198.099976,1198.500000,1186.199951,1195.000000,1195.000000,0
2003-12-03,1195.000000,1198.400024,1192.500000,1192.500000,1192.500000,0
2003-12-04,1192.599976,1197.900024,1174.800049,1190.099976,1190.099976,0
2003-12-05,1189.400024,1193.800049,1178.599976,1184.699951,1184.699951,0

In [16]:
df_rate.tail()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2024-04-19,1379.400024,1392.619995,1374.569946,1379.400024,1379.400024,0
2024-04-22,1373.930054,1382.930054,1373.410034,1373.930054,1373.930054,0
2024-04-23,1378.839966,1379.609985,1371.209961,1378.839966,1378.839966,0
2024-04-24,1370.479980,1377.430054,1366.790039,1370.479980,1370.479980,0
2024-04-25,1376.969971,1379.089966,1370.560059,1376.969971,1376.969971,0

In [17]:
df_rate.to_csv('./usdkrw.csv')

In [18]:
df_gold = yf.download('GC=F')
df_gold.head()

[*********************100%%**********************]  1 of 1 completed

                  Open        High         Low       Close   Adj Close  Volume
Date
2000-08-30  273.899994  273.899994  273.899994  273.899994  273.899994       0
2000-08-31  274.799988  278.299988  274.799988  278.299988  278.299988       0
2000-09-01  277.000000  277.000000  277.000000  277.000000  277.000000       0
2000-09-05  275.799988  275.799988  275.799988  275.799988  275.799988       2
2000-09-06  274.200012  274.200012  274.200012  274.200012  274.200012       0

In [19]:
df_gold.to_csv('./gold.csv')

In [20]:
df_snp = yf.download('^GSPC')
df_snp.head()

[*********************100%%**********************]  1 of 1 completed

                 Open       High        Low      Close  Adj Close  Volume
Date
1927-12-30  17.660000  17.660000  17.660000  17.660000  17.660000       0
1928-01-03  17.760000  17.760000  17.760000  17.760000  17.760000       0
1928-01-04  17.719999  17.719999  17.719999  17.719999  17.719999       0
1928-01-05  17.549999  17.549999  17.549999  17.549999  17.549999       0
1928-01-06  17.660000  17.660000  17.660000  17.660000  17.660000       0

In [21]:
df_snp.tail()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2024-04-19,5005.439941,5019.020020,4953.560059,4967.229980,4967.229980,3878750000
2024-04-22,4987.330078,5038.839844,4969.399902,5010.600098,5010.600098,3820250000
2024-04-23,5028.850098,5076.120117,5027.959961,5070.549805,5070.549805,3751400000
2024-04-24,5084.859863,5089.479980,5047.020020,5071.629883,5071.629883,3656740000
2024-04-25,5019.879883,5057.750000,4990.580078,5048.419922,5048.419922,3958050000

In [22]:
df_snp.to_csv('./snp.csv')

In [23]:
df_ko = yf.download('^KS11')
df_ko.to_csv('./kospi.csv')
df_ko.head()

[*********************100%%**********************]  1 of 1 completed

                  Open        High         Low       Close   Adj Close  Volume
Date
1996-12-11  705.989990  709.479980  704.429993  704.679993  704.679993   28000
1996-12-12  705.109985  706.010010  688.739990  689.380005  689.380005   25900
1996-12-13  690.440002  695.719971  677.640015  689.070007  689.070007   26500
1996-12-16  686.969971  686.969971  667.710022  673.919983  673.919983   22800
1996-12-17  675.349976  680.090027  660.390015  663.349976  663.349976   31600

In [24]:
df_index = pd.concat([df_snp['Close'], df_ko['Close']], axis=1).loc['1996-12-11': , :]
df_index.columns = ['S&P', 'KOSPI']
df_index.head()

                   S&P       KOSPI
Date
1996-12-11  740.729980  704.679993
1996-12-12  729.299988  689.380005
1996-12-13  728.640015  689.070007
1996-12-16  720.979980  673.919983
1996-12-17  726.039978  663.349976

In [25]:
df_snp.loc['1996-12-11':'1996-12-31', :]

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
1996-12-11,747.539978,747.539978,732.750000,740.729980,740.729980,494210000
1996-12-12,740.729980,744.859985,729.299988,729.299988,729.299988,492920000
1996-12-13,729.330017,731.400024,721.969971,728.640015,728.640015,458540000
1996-12-16,728.640015,732.679993,719.400024,720.979980,720.979980,447560000
1996-12-17,720.979980,727.669983,716.690002,726.039978,726.039978,519840000
1996-12-18,726.039978,732.760010,726.039978,731.539978,731.539978,500490000
1996-12-19,731.539978,746.059998,731.539978,745.760010,745.760010,526410000
1996-12-20,745.760010,755.409973,745.760010,748.869995,748.869995,654340000
1996-12-23,748.869995,750.400024,743.280029,746.919983,746.919983,343280000
1996-12-24,746.919983,751.030029,746.919983,751.030029,751.030029,165140000
1996-12-26,751.030029,757.070007,751.020020,755.820007,755.820007,254630000
1996-12-27,755.820007,758.750000,754.820007,756.789978,756.789978,253810000
1996-12-30,756.789978,759.200012,752.729980,753.849976,753.849976,339060000
1996-12-31,753.849976,753.950012,740.739990,740.739990,740.739990,399760000

In [26]:
df_sec = yf.download('005930.KS')
df_sec.to_csv('./sec.csv')
df_sec.tail()

[*********************100%%**********************]  1 of 1 completed

               Open     High      Low    Close  Adj Close    Volume
Date
2024-04-22  77400.0  77500.0  75100.0  76100.0    76100.0  30469477
2024-04-23  76400.0  76800.0  75500.0  75500.0    75500.0  18717699
2024-04-24  77500.0  78800.0  77200.0  78600.0    78600.0  22166150
2024-04-25  77300.0  77500.0  76300.0  76300.0    76300.0  15549134
2024-04-26  77800.0  77900.0  76800.0  77200.0    77200.0   6087729